<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"bfa7e3f45bf7f48d659ce03ebfa458c498f536a17cd0867258b06ee0e40e980d","plan_job_ref":"Job Staging Image Build & Push #3 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7343057160","plan_hash":"953bce7f8e94b6253c8dc47c5df29f8f05fa6dc47d728b21613437c4477442d6","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 9 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ecrpublic_repository.fastapi-ecr-public will be created
+   resource "aws_ecrpublic_repository" "fastapi-ecr-public" {
+       arn             = (known after apply)
+       force_destroy   = false
+       id              = (known after apply)
+       registry_id     = (known after apply)
+       repository_name = "dev/irezd/fastapi"
+       repository_uri  = (known after apply)
+       tags_all        = {
+           "Environment" = "Dev Environment"
        }

+       catalog_data {
+           about_text      = "A FastAPI docker image"
+           description     = "This is a containerized images of FastAPI stored on ECR dev environment"
+           logo_image_blob = (known after apply)
        }
    }

  # aws_ecs_cluster.fastapi-cluster will be created
+   resource "aws_ecs_cluster" "fastapi-cluster" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "fastapi-cluster"
+       tags_all = {
+           "Environment" = "Dev Environment"
        }

+       setting {
+           name  = "containerInsights"
+           value = "enabled"
        }
    }

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "dev-fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       load_balancer {
+           container_name   = "dev_FastAPI_image"
+           container_port   = 5000
+           target_group_arn = (known after apply)
        }

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = (known after apply)
+           subnets          = (sensitive value)
        }
    }

  # aws_ecs_task_definition.task_definition will be created
+   resource "aws_ecs_task_definition" "task_definition" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (known after apply)
+       cpu                      = "1024"
+       family                   = "dev-fastapi-container"
+       id                       = (known after apply)
+       memory                   = "2048"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "Environment" = "Dev Environment"
        }
    }

  # aws_lb.alb will be created
+   resource "aws_lb" "alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = false
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "fastapi-lb-dev"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = (sensitive value)
+       tags_all                                                     = {
+           "Environment" = "Dev Environment"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.front_end will be created
+   resource "aws_lb_listener" "front_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.target_group_P-5000 will be created
+   resource "aws_lb_target_group" "target_group_P-5000" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "alb-target-group"
+       name_prefix                        = (known after apply)
+       port                               = 5000
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       target_type                        = "ip"
+       vpc_id                             = "*********************"
    }

  # aws_security_group.ALB_to_containers will be created
+   resource "aws_security_group" "ALB_to_containers" {
+       arn                    = (known after apply)
+       description            = "Allowing traffic from ALB to containers for dev FastAPI environment"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = (known after apply)
+               description      = "Inbound ALB to ECS containers"
+               from_port        = 5000
+               ipv6_cidr_blocks = (known after apply)
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 5000
            },
        ]
+       name                   = "alb-to-containers"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.internet_to_ALB will be created
+   resource "aws_security_group" "internet_to_ALB" {
+       arn                    = (known after apply)
+       description            = "Inbound traffic from the internet into ALB for dev FastAPI environment"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Inbound from Internet to ALB"
+               from_port        = 80
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
        ]
+       name                   = "internet-to-alb"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       vpc_id                 = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   ecr_registry_id     = (known after apply)
+   ecr_repository_name = "dev/irezd/fastapi"
```
</details>

:x: Error applying plan in [Staging Image Build & Push #3](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7343057160)